using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;

namespace PharmTaxiAPI.Models
{
	public class BarcodeDetectResponse
	{
		public bool Successed { get; set; }
		public string Message { get; set; }

		//id_ФП 
		//	название ФП 
		//id_ТН 
		//	назвние ТН 
		//id_ ЛФ 
		//	название ЛФ 
		//дозировка (если это комбинированный препарат то дозировок будет несколько) 
		//	id_единицы измерения дозировки (если это комбинированный препарат то дозировок будет несколько) 
		//	название единицы измерения дозировки/дозировок (если это комбинированный препарат, то для каждой дозировки будут соответствующие единицы измерения) 
		//id_фармпроизводителя 
		//	название фармпроизводителя 
		//id_страны производителя 
		//	страна производителя 
		//id_упаковки 
		//	название упаковки 
		//	количество лекарственных форм в упаковке 
		//Штрих-код 
		//Уникального идентификатора товара 
		//номер регистрационного удостоверения 
		//дата регистрации 
		//страна регистрации 
		//юридическое лицо, на имя которого выдано регистрационное удостоверение 
		//дата окончания действия регистрационного удостоверения 
		//дата аннулирования регистрационного удостоверения 
		//статус регистрационного удостоверения (1 разрешено; -1 срок истек; -2 анулирован; 0 или NULL - неизвестно) 

		//серийный номер Batch 
		//срок годности EXP 
		//уникальный код упаковки 
	}
}